tutorials/tutorialCoextrusion/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 493.15;
//existing boundaries (ignore everything else and set defaultfaces to empty) ['', '    outlet\n', '    defaultName\n', '    inlet\n']
boundaryField
{


    centralInlet
    {
        type            zeroGradient;		
    }

    defaultName
    {
        type            zeroGradient;		
    }

    leftInlet
    {
        type            fixedValue;
        value           uniform 493.15;
    }

    rightInlet
    {
        type            fixedValue;
        value           uniform 493.15;
    }
	
    outlet
    {
        type            zeroGradient;
	// wird berechnet
    }
}

// ************************************************************************* //
